In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\abhid\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: pytz>=2017.3 in c:\users\abhid\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\abhid\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in c:\users\abhid\anaconda3\lib\site-packages (from pandas) (1.19.5)
Requirement already satisfied: six>=1.5 in c:\users\abhid\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas as pd

In [3]:
ex1=pd.read_csv("ex1.csv")
ex1.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
type(ex1)

pandas.core.frame.DataFrame

In [6]:
d=ex1["a"]

In [7]:
 type(d)

pandas.core.series.Series

In [8]:
list(d)

[1, 5, 9]

In [9]:
test=pd.read_table("test.tsv")

In [11]:
test.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [12]:
df=pd.read_csv("ex1.csv",header=None)
df

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [13]:
pd.read_csv("ex1.csv",header=None,names=["Abhisek","Datta","Kalyani","Git","Link"])

  Abhisek Datta Kalyani Git     Link
0       a     b       c   d  message
1       1     2       3   4    hello
2       5     6       7   8    world
3       9    10      11  12      foo

In [17]:
mindex=pd.read_csv("csv_mindex.csv")
mindex

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [16]:
pd.read_csv("csv_mindex.csv",index_col=["key1","key2"])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [19]:
ex4=pd.read_csv("ex4.csv",skiprows=[0,2,3])
ex4

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [20]:
ex5=pd.read_csv("ex5.csv")
ex5

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
ex5.isnull().sum()

something    0
a            0
b            0
c            1
d            0
message      1
dtype: int64

In [25]:
ex=pd.read_excel("ex1.xlsx",sheet_name="Sheet1")

In [26]:
ex

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo